tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18856_tdd.h
#define CLC4SEL0                      3323
#define LC4D1S0                       3324
#define CLC4SEL0_D1S                  3325
#define CLC4SEL0_D1S0                 3326
#define LC4D1S                        3327
#define LC4D1S1                       3328
#define CLC4SEL0_D1S1                 3329
#define LC4D1S2                       3330
#define CLC4SEL0_D1S2                 3331
#define LC4D1S3                       3332
#define CLC4SEL0_D1S3                 3333
#define LC4D1S4                       3334
#define CLC4SEL0_D1S4                 3335
#define LC4D1S5                       3336
#define CLC4SEL0_D1S5                 3337
#define LC4D1S6                       3338
#define CLC4SEL0_D1S6                 3339
#define LC4D1S7                       3340
#define CLC4SEL0_D1S7                 3341
#define CLC4SEL1                      3342
#define CLC4SEL1_D2S                  3343
#define CLC4SEL1_D2S0                 3344
#define LC4D2S                        3345
#define LC4D2S0                       3346
#define CLC4SEL1_D2S1                 3347
#define LC4D2S1                       3348
#define CLC4SEL1_D2S2                 3349
#define LC4D2S2                       3350
#define CLC4SEL1_D2S3                 3351
#define LC4D2S3                       3352
#define CLC4SEL1_D2S4                 3353
#define LC4D2S4                       3354
#define CLC4SEL1_D2S5                 3355
#define LC4D2S5                       3356
#define CLC4SEL1_D2S6                 3357
#define LC4D2S6                       3358
#define CLC4SEL1_D2S7                 3359
#define LC4D2S7                       3360
#define CLC4SEL2                      3361
#define CLC4SEL2_D3S                  3362
#define LC4D3S0                       3363
#define LC4D3S                        3364
#define CLC4SEL2_D3S0                 3365
#define LC4D3S1                       3366
#define CLC4SEL2_D3S1                 3367
#define LC4D3S2                       3368
#define CLC4SEL2_D3S2                 3369
#define LC4D3S3                       3370
#define CLC4SEL2_D3S3                 3371
#define LC4D3S4                       3372
#define CLC4SEL2_D3S4                 3373
#define LC4D3S5                       3374
#define CLC4SEL2_D3S5                 3375
#define LC4D3S6                       3376
#define CLC4SEL2_D3S6                 3377
#define LC4D3S7                       3378
#define CLC4SEL2_D3S7                 3379
#define CLC4SEL3                      3380
#define CLC4SEL3_D4S                  3381
#define LC4D4S0                       3382
#define CLC4SEL3_D4S0                 3383
#define LC4D4S                        3384
#define LC4D4S1                       3385
#define CLC4SEL3_D4S1                 3386
#define LC4D4S2                       3387
#define CLC4SEL3_D4S2                 3388
#define LC4D4S3                       3389
#define CLC4SEL3_D4S3                 3390
#define LC4D4S4                       3391
#define CLC4SEL3_D4S4                 3392
#define LC4D4S5                       3393
#define CLC4SEL3_D4S5                 3394
#define LC4D4S6                       3395
#define CLC4SEL3_D4S6                 3396
#define LC4D4S7                       3397
#define CLC4SEL3_D4S7                 3398
#define CLC4GLS0                      3399
#define CLC4GLS0_D1N                  3400
#define LC4G1D1N                      3401
#define CLC4GLS0_D1T                  3402
#define LC4G1D1T                      3403
#define CLC4GLS0_D2N                  3404
#define LC4G1D2N                      3405
#define CLC4GLS0_D2T                  3406
#define LC4G1D2T                      3407
#define CLC4GLS0_D3N                  3408
#define LC4G1D3N                      3409
#define CLC4GLS0_D3T                  3410
#define LC4G1D3T                      3411
#define CLC4GLS0_D4N                  3412
#define LC4G1D4N                      3413
#define CLC4GLS0_D4T                  3414
#define LC4G1D4T                      3415
#define CLC4GLS1                      3416
#define CLC4GLS1_D1N                  3417
#define LC4G2D1N                      3418
#define CLC4GLS1_D1T                  3419
#define LC4G2D1T                      3420
#define LC4G2D2N                      3421
#define CLC4GLS1_D2N                  3422
#define LC4G2D2T                      3423
#define CLC4GLS1_D2T                  3424
#define CLC4GLS1_D3N                  3425
#define LC4G2D3N                      3426
#define LC4G2D3T                      3427
#define CLC4GLS1_D3T                  3428
#define CLC4GLS1_D4N                  3429
#define LC4G2D4N                      3430
#define CLC4GLS1_D4T                  3431
#define LC4G2D4T                      3432
#define CLC4GLS2                      3433
#define CLC4GLS2_D1N                  3434
#define LC4G3D1N                      3435
#define CLC4GLS2_D1T                  3436
#define LC4G3D1T                      3437
#define LC4G3D2N                      3438
#define CLC4GLS2_D2N                  3439
#define LC4G3D2T                      3440
#define CLC4GLS2_D2T                  3441
#define CLC4GLS2_D3N                  3442
#define LC4G3D3N                      3443
#define CLC4GLS2_D3T                  3444
#define LC4G3D3T                      3445
#define LC4G3D4N                      3446
#define CLC4GLS2_D4N                  3447
#define LC4G3D4T                      3448
#define CLC4GLS2_D4T                  3449
#define CLC4GLS3                      3450
#define CLC4GLS3_G4D1N                3451
#define LC4G4D1N                      3452
#define LC4G4D1T                      3453
#define CLC4GLS3_G4D1T                3454
#define LC4G4D2N                      3455
#define CLC4GLS3_G4D2N                3456
#define LC4G4D2T                      3457
#define CLC4GLS3_G4D2T                3458
#define CLC4GLS3_G4D3N                3459
#define LC4G4D3N                      3460
#define CLC4GLS3_G4D3T                3461
#define LC4G4D3T                      3462
#define LC4G4D4N                      3463
#define CLC4GLS3_G4D4N                3464
#define LC4G4D4T                      3465
#define CLC4GLS3_G4D4T                3466
#define PPSLOCK                       3467
#define PPSLOCKED                     3468
#define INTPPS0                       3469
#define INTPPS                        3470
#define INTPPS1                       3471
#define INTPPS2                       3472
#define INTPPS3                       3473
#define T0CKIPPS                      3474
#define T0CKIPPS0                     3475
#define T0CKIPPS1                     3476
#define T0CKIPPS2                     3477
#define T0CKIPPS3                     3478
#define T1CKIPPS0                     3479
#define T1CKIPPS                      3480
#define T1CKIPPS1                     3481
#define T1CKIPPS2                     3482
#define T1CKIPPS3                     3483
#define T1CKIPPS4                     3484
#define T1GPPS0                       3485
#define T1GPPS                        3486
#define T1GPPS1                       3487
#define T1GPPS2                       3488
#define T1GPPS3                       3489
#define T1GPPS4                       3490
#define T3CKIPPS0                     3491
#define T3CKIPPS                      3492
#define T3CKIPPS1                     3493
#define T3CKIPPS2                     3494
#define T3CKIPPS3                     3495
#define T3CKIPPS4                     3496
#define T3GPPS0                       3497
#define T3GPPS                        3498
#define T3GPPS1                       3499
#define T3GPPS2                       3500
#define T3GPPS3                       3501
#define T3GPPS4                       3502
#define T5CKIPPS0                     3503
#define T5CKIPPS                      3504
#define T5CKIPPS1                     3505
#define T5CKIPPS2                     3506
#define T5CKIPPS3                     3507
#define T5CKIPPS4                     3508
#define T5GPPS                        3509
#define T5GPPS0                       3510
#define T5GPPS1                       3511
#define T5GPPS2                       3512
#define T5GPPS3                       3513
#define T5GPPS4                       3514
#define T2AINPPS                      3515
#define T2AINPPS0                     3516
#define T2AINPPS1                     3517
#define T2AINPPS2                     3518
#define T2AINPPS3                     3519
#define T2AINPPS4                     3520
#define T4AINPPS                      3521
#define T4AINPPS0                     3522
#define T4AINPPS1                     3523
#define T4AINPPS2                     3524
#define T4AINPPS3                     3525
#define T4AINPPS4                     3526
#define T6AINPPS0                     3527
#define T6AINPPS                      3528
#define T6AINPPS1                     3529
#define T6AINPPS2                     3530
#define T6AINPPS3                     3531
#define T6AINPPS4                     3532
#define CCP1PPS0                      3533
#define CCP1PPS                       3534
#define CCP1PPS1                      3535
#define CCP1PPS2                      3536
#define CCP1PPS3                      3537
#define CCP1PPS4                      3538
#define CCP2PPS0                      3539
#define CCP2PPS                       3540
#define CCP2PPS1                      3541
#define CCP2PPS2                      3542
#define CCP2PPS3                      3543
#define CCP2PPS4                      3544
#define CCP3PPS0                      3545
#define CCP3PPS                       3546
#define CCP3PPS1                      3547
#define CCP3PPS2                      3548
#define CCP3PPS3                      3549
#define CCP3PPS4                      3550
#define CCP4PPS0                      3551
#define CCP4PPS                       3552
#define CCP4PPS1                      3553
#define CCP4PPS2                      3554
#define CCP4PPS3                      3555
#define CCP4PPS4                      3556
#define CCP5PPS                       3557
#define CCP5PPS0                      3558
#define CCP5PPS1                      3559
#define CCP5PPS2                      3560
#define CCP5PPS3                      3561
#define CCP5PPS4                      3562
#define CCP6PPS                       3563
#define SMT1WINPPS                    3564
#define SMU1WINPPS0                   3565
#define SMU1WINPPS1                   3566
#define SMU1WINPPS2                   3567
#define SMU1WINPPS3                   3568
#define SMU1WINPPS4                   3569
#define SMT1SIGPPS                    3570
#define SMU1SIGPPS0                   3571
#define SMU1SIGPPS1                   3572
#define SMU1SIGPPS2                   3573
#define SMU1SIGPPS3                   3574
#define SMU1SIGPPS4                   3575
#define SMT2WINPPS                    3576
#define SMU2WINPPS0                   3577
#define SMU2WINPPS1                   3578
#define SMU2WINPPS2                   3579
#define SMU2WINPPS3                   3580
#define SMU2WINPPS4                   3581
#define SMT2SIGPPS                    3582
#define SMU2SIGPPS0                   3583
#define SMU2SIGPPS1                   3584
#define SMU2SIGPPS2                   3585
#define SMU2SIGPPS3                   3586
#define SMU2SIGPPS4                   3587
#define CWG1PPS0                      3588
#define CWG1PPS                       3589
#define CWG1PPS1                      3590
#define CWG1PPS2                      3591
#define CWG1PPS3                      3592
#define CWG1PPS4                      3593
#define CWG2PPS0                      3594
#define CWG2PPS                       3595
#define CWG2PPS1                      3596
#define CWG2PPS2                      3597
#define CWG2PPS3                      3598
#define CWG2PPS4                      3599
#define CWG3PPS0                      3600
#define CWG3PPS                       3601
#define CWG3PPS1                      3602
#define CWG3PPS2                      3603
#define CWG3PPS3                      3604
#define CWG3PPS4                      3605
#define MDCARLPPS                     3606
#define MDCARLPPS0                    3607
#define MDCARLPPS1                    3608
#define MDCARLPPS2                    3609
#define MDCARLPPS3                    3610
#define MDCARLPPS4                    3611
#define MDCARHPPS0                    3612
#define MDCARHPPS                     3613
#define MDCARHPPS1                    3614
#define MDCARHPPS2                    3615
#define MDCARHPPS3                    3616
#define MDCARHPPS4                    3617
#define MDSRCPPS0                     3618
#define MDSRCPPS                      3619
#define MDSRCPPS1                     3620
#define MDSRCPPS2                     3621
#define MDSRCPPS3                     3622
#define MDSRCPPS4                     3623
#define CLCIN0PPS                     3624
#define CLCIN0PPS0                    3625
#define CLCIN0PPS1                    3626
#define CLCIN0PPS2                    3627
#define CLCIN0PPS3                    3628
#define CLCIN0PPS4                    3629
#define CLCIN1PPS0                    3630
#define CLCIN1PPS                     3631
#define CLCIN1PPS1                    3632
#define CLCIN1PPS2                    3633
#define CLCIN1PPS3                    3634
#define CLCIN1PPS4                    3635
#define CLCIN2PPS                     3636
#define CLCIN2PPS0                    3637
#define CLCIN2PPS1                    3638
#define CLCIN2PPS2                    3639
#define CLCIN2PPS3                    3640
#define CLCIN2PPS4                    3641
#define CLCIN3PPS                     3642
#define CLCIN3PPS0                    3643
#define CLCIN3PPS1                    3644
#define CLCIN3PPS2                    3645
#define CLCIN3PPS3                    3646
#define CLCIN3PPS4                    3647
#define ADCACTPPS                     3648
#define ADCACTPPS0                    3649
#define ADCACTPPS1                    3650
#define ADCACTPPS2                    3651
#define ADCACTPPS3                    3652
#define ADCACTPPS4                    3653
#define SSP1CLKPPS0                   3654
#define SSP1CLKPPS                    3655
#define SSP1CLKPPS1                   3656
#define SSP1CLKPPS2                   3657
#define SSP1CLKPPS3                   3658
#define SSP1CLKPPS4                   3659
#define SSP1DATPPS0                   3660
#define SSP1DATPPS                    3661
#define SSP1DATPPS1                   3662
#define SSP1DATPPS2                   3663
#define SSP1DATPPS3                   3664
#define SSP1DATPPS4                   3665
#define SSP1SSPPS                     3666
#define SSP1SSPPS0                    3667
#define SSP1SSPPS1                    3668
#define SSP1SSPPS2                    3669
#define SSP1SSPPS3                    3670
#define SSP1SSPPS4                    3671
#define SSP2CLKPPS                    3672
#define SSP2CLKPPS0                   3673
#define SSP2CLKPPS1                   3674
#define SSP2CLKPPS2                   3675
#define SSP2CLKPPS3                   3676
#define SSP2CLKPPS4                   3677
#define SSP2DATPPS                    3678
#define SSP2DATPPS0                   3679
#define SSP2DATPPS1                   3680
#define SSP2DATPPS2                   3681
#define SSP2DATPPS3                   3682
#define SSP2DATPPS4                   3683
#define SSP2SSPPS                     3684
#define SSP2SSPPS0                    3685
#define SSP2SSPPS1                    3686
#define SSP2SSPPS2                    3687
#define SSP2SSPPS3                    3688
#define SSP2SSPPS4                    3689
#define RXPPS                         3690
#define RXPPS0                        3691
#define RXPPS1                        3692
#define RXPPS2                        3693
#define RXPPS3                        3694
#define RXPPS4                        3695
#define TXPPS0                        3696
#define TXPPS                         3697
#define TXPPS1                        3698
#define TXPPS2                        3699
#define TXPPS3                        3700
#define TXPPS4                        3701
#define RA0PPS                        3702
#define RA0PPS0                       3703
#define RA0PPS1                       3704
#define RA0PPS2                       3705
#define RA0PPS3                       3706
#define RA0PPS4                       3707
#define RA0PPS5                       3708
#define RA1PPS                        3709
#define RA1PPS0                       3710
#define RA1PPS1                       3711
#define RA1PPS2                       3712
#define RA1PPS3                       3713
#define RA1PPS4                       3714
#define RA1PPS5                       3715
#define RA2PPS                        3716
#define RA2PPS0                       3717
#define RA2PPS1                       3718
#define RA2PPS2                       3719
#define RA2PPS3                       3720
#define RA2PPS4                       3721
#define RA2PPS5                       3722
#define RA3PPS                        3723
#define RA3PPS0                       3724
#define RA3PPS1                       3725
#define RA3PPS2                       3726
#define RA3PPS3                       3727
#define RA3PPS4                       3728
#define RA3PPS5                       3729
#define RA4PPS                        3730
#define RA4PPS0                       3731
#define RA4PPS1                       3732
#define RA4PPS2                       3733
#define RA4PPS3                       3734
#define RA4PPS4                       3735
#define RA4PPS5                       3736
#define RA5PPS                        3737
#define RA5PPS0                       3738
#define RA5PPS1                       3739
#define RA5PPS2                       3740
#define RA5PPS3                       3741
#define RA5PPS4                       3742
#define RA5PPS5                       3743
#define RA6PPS                        3744
#define RA6PPS0                       3745
#define RA6PPS1                       3746
#define RA6PPS2                       3747
#define RA6PPS3                       3748
#define RA6PPS4                       3749
#define RA6PPS5                       3750
#define RA7PPS                        3751
#define RA7PPS0                       3752
#define RA7PPS1                       3753
#define RA7PPS2                       3754
#define RA7PPS3                       3755
#define RA7PPS4                       3756
#define RA7PPS5                       3757
#define RB0PPS                        3758
#define RB0PPS0                       3759
#define RB0PPS1                       3760
#define RB0PPS2                       3761
#define RB0PPS3                       3762
#define RB0PPS4                       3763
#define RB0PPS5                       3764
#define RB1PPS                        3765
#define RB1PPS0                       3766
#define RB1PPS1                       3767
#define RB1PPS2                       3768
#define RB1PPS3                       3769
#define RB1PPS4                       3770
#define RB1PPS5                       3771
#define RB2PPS                        3772
#define RB2PPS0                       3773
#define RB2PPS1                       3774
#define RB2PPS2                       3775
#define RB2PPS3                       3776
#define RB2PPS4                       3777
#define RB2PPS5                       3778
#define RB3PPS                        3779
#define RB3PPS0                       3780
#define RB3PPS1                       3781
#define RB3PPS2                       3782
#define RB3PPS3                       3783
#define RB3PPS4                       3784
#define RB3PPS5                       3785
#define RB4PPS                        3786
#define RB4PPS0                       3787
#define RB4PPS1                       3788
#define RB4PPS2                       3789
#define RB4PPS3                       3790
#define RB4PPS4                       3791
#define RB4PPS5                       3792
#define RB5PPS                        3793
#define RB5PPS0                       3794
#define RB5PPS1                       3795
#define RB5PPS2                       3796
#define RB5PPS3                       3797
#define RB5PPS4                       3798
#define RB5PPS5                       3799
#define RB6PPS                        3800
#define RB6PPS0                       3801
#define RB6PPS1                       3802
#define RB6PPS2                       3803
#define RB6PPS3                       3804
#define RB6PPS4                       3805
#define RB6PPS5                       3806
#define RB7PPS                        3807
#define RB7PPS0                       3808
#define RB7PPS1                       3809
#define RB7PPS2                       3810
#define RB7PPS3                       3811
#define RB7PPS4                       3812
#define RB7PPS5                       3813
#define RC0PPS                        3814
#define RC0PPS0                       3815
#define RC0PPS1                       3816
#define RC0PPS2                       3817
#define RC0PPS3                       3818
#define RC0PPS4                       3819
#define RC0PPS5                       3820
#define RC1PPS                        3821
#define RC1PPS0                       3822
#define RC1PPS1                       3823
#define RC1PPS2                       3824
#define RC1PPS3                       3825
#define RC1PPS4                       3826
#define RC1PPS5                       3827
#define RC2PPS                        3828
#define RC2PPS0                       3829
#define RC2PPS1                       3830
#define RC2PPS2                       3831
#define RC2PPS3                       3832
#define RC2PPS4                       3833
#define RC2PPS5                       3834
#define RC3PPS                        3835
#define RC3PPS0                       3836
#define RC3PPS1                       3837
#define RC3PPS2                       3838
#define RC3PPS3                       3839
#define RC3PPS4                       3840
#define RC3PPS5                       3841
#define RC4PPS                        3842
#define RC4PPS0                       3843
#define RC4PPS1                       3844
#define RC4PPS2                       3845
#define RC4PPS3                       3846
#define RC4PPS4                       3847
#define RC4PPS5                       3848
#define RC5PPS                        3849
#define RC5PPS0                       3850
#define RC5PPS1                       3851
#define RC5PPS2                       3852
#define RC5PPS3                       3853
#define RC5PPS4                       3854
#define RC5PPS5                       3855
#define RC6PPS                        3856
#define RC6PPS0                       3857
#define RC6PPS1                       3858
#define RC6PPS2                       3859
#define RC6PPS3                       3860
#define RC6PPS4                       3861
#define RC6PPS5                       3862
#define RC7PPS                        3863
#define RC7PPS0                       3864
#define RC7PPS1                       3865
#define RC7PPS2                       3866
#define RC7PPS3                       3867
#define RC7PPS4                       3868
#define RC7PPS5                       3869
#define ANSELA                        3870
#define ANSA0                         3871
#define ANSA1                         3872
#define ANSA2                         3873
#define ANSA3                         3874
#define ANSA4                         3875
#define ANSA5                         3876
#define ANSA6                         3877
#define ANSA7                         3878
#define WPUA                          3879
#define WPUA0                         3880
