tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18856_tdd.h
#define WPUA1                         3881
#define WPUA2                         3882
#define WPUA3                         3883
#define WPUA4                         3884
#define WPUA5                         3885
#define WPUA6                         3886
#define WPUA7                         3887
#define ODCONA                        3888
#define ODCA0                         3889
#define ODCA1                         3890
#define ODCA2                         3891
#define ODCA3                         3892
#define ODCA4                         3893
#define ODCA5                         3894
#define ODCA6                         3895
#define ODCA7                         3896
#define SLRCONA                       3897
#define SLRA0                         3898
#define SLRA1                         3899
#define SLRA2                         3900
#define SLRA3                         3901
#define SLRA4                         3902
#define SLRA5                         3903
#define SLRA6                         3904
#define SLRA7                         3905
#define INLVLA                        3906
#define INLVLA0                       3907
#define INLVLA1                       3908
#define INLVLA2                       3909
#define INLVLA3                       3910
#define INLVLA4                       3911
#define INLVLA5                       3912
#define INLVLA6                       3913
#define INLVLA7                       3914
#define IOCAP                         3915
#define IOCAP0                        3916
#define IOCAP1                        3917
#define IOCAP2                        3918
#define IOCAP3                        3919
#define IOCAP4                        3920
#define IOCAP5                        3921
#define IOCAP6                        3922
#define IOCAP7                        3923
#define IOCAN                         3924
#define IOCAN0                        3925
#define IOCAN1                        3926
#define IOCAN2                        3927
#define IOCAN3                        3928
#define IOCAN4                        3929
#define IOCAN5                        3930
#define IOCAN6                        3931
#define IOCAN7                        3932
#define IOCAF                         3933
#define IOCAF0                        3934
#define IOCAF1                        3935
#define IOCAF2                        3936
#define IOCAF3                        3937
#define IOCAF4                        3938
#define IOCAF5                        3939
#define IOCAF6                        3940
#define IOCAF7                        3941
#define CCDNA                         3942
#define CCDNA0                        3943
#define CCDNA1                        3944
#define CCDNA2                        3945
#define CCDNA3                        3946
#define CCDNA4                        3947
#define CCDNA5                        3948
#define CCDNA6                        3949
#define CCDNA7                        3950
#define CCDPA                         3951
#define CCDPA0                        3952
#define CCDPA1                        3953
#define CCDPA2                        3954
#define CCDPA3                        3955
#define CCDPA4                        3956
#define CCDPA5                        3957
#define CCDPA6                        3958
#define CCDPA7                        3959
#define ANSELB                        3960
#define ANSB0                         3961
#define ANSB1                         3962
#define ANSB2                         3963
#define ANSB3                         3964
#define ANSB4                         3965
#define ANSB5                         3966
#define ANSB6                         3967
#define ANSB7                         3968
#define WPUB                          3969
#define WPUB0                         3970
#define WPUB1                         3971
#define WPUB2                         3972
#define WPUB3                         3973
#define WPUB4                         3974
#define WPUB5                         3975
#define WPUB6                         3976
#define WPUB7                         3977
#define ODCONB                        3978
#define ODCB0                         3979
#define ODCB1                         3980
#define ODCB2                         3981
#define ODCB3                         3982
#define ODCB4                         3983
#define ODCB5                         3984
#define ODCB6                         3985
#define ODCB7                         3986
#define SLRCONB                       3987
#define SLRB0                         3988
#define SLRB1                         3989
#define SLRB2                         3990
#define SLRB3                         3991
#define SLRB4                         3992
#define SLRB5                         3993
#define SLRB6                         3994
#define SLRB7                         3995
#define INLVLB                        3996
#define INLVLB0                       3997
#define INLVLB1                       3998
#define INLVLB2                       3999
#define INLVLB3                       4000
#define INLVLB4                       4001
#define INLVLB5                       4002
#define INLVLB6                       4003
#define INLVLB7                       4004
#define IOCBP                         4005
#define IOCBP0                        4006
#define IOCBP1                        4007
#define IOCBP2                        4008
#define IOCBP3                        4009
#define IOCBP4                        4010
#define IOCBP5                        4011
#define IOCBP6                        4012
#define IOCBP7                        4013
#define IOCBN                         4014
#define IOCBN0                        4015
#define IOCBN1                        4016
#define IOCBN2                        4017
#define IOCBN3                        4018
#define IOCBN4                        4019
#define IOCBN5                        4020
#define IOCBN6                        4021
#define IOCBN7                        4022
#define IOCBF                         4023
#define IOCBF0                        4024
#define IOCBF1                        4025
#define IOCBF2                        4026
#define IOCBF3                        4027
#define IOCBF4                        4028
#define IOCBF5                        4029
#define IOCBF6                        4030
#define IOCBF7                        4031
#define CCDNB                         4032
#define CCDNB0                        4033
#define CCDNB1                        4034
#define CCDNB2                        4035
#define CCDNB3                        4036
#define CCDNB4                        4037
#define CCDNB5                        4038
#define CCDNB6                        4039
#define CCDNB7                        4040
#define CCDPB                         4041
#define CCDPB0                        4042
#define CCDPB1                        4043
#define CCDPB2                        4044
#define CCDPB3                        4045
#define CCDPB4                        4046
#define CCDPB5                        4047
#define CCDPB6                        4048
#define CCDPB7                        4049
#define ANSELC                        4050
#define ANSC0                         4051
#define ANSC1                         4052
#define ANSC2                         4053
#define ANSC3                         4054
#define ANSC4                         4055
#define ANSC5                         4056
#define ANSC6                         4057
#define ANSC7                         4058
#define WPUC                          4059
#define WPUC0                         4060
#define WPUC1                         4061
#define WPUC2                         4062
#define WPUC3                         4063
#define WPUC4                         4064
#define WPUC5                         4065
#define WPUC6                         4066
#define WPUC7                         4067
#define ODCONC                        4068
#define ODCC0                         4069
#define ODCC1                         4070
#define ODCC2                         4071
#define ODCC3                         4072
#define ODCC4                         4073
#define ODCC5                         4074
#define ODCC6                         4075
#define ODCC7                         4076
#define SLRCONC                       4077
#define SLRC0                         4078
#define SLRC1                         4079
#define SLRC2                         4080
#define SLRC3                         4081
#define SLRC4                         4082
#define SLRC5                         4083
#define SLRC6                         4084
#define SLRC7                         4085
#define INLVLC                        4086
#define INLVLC0                       4087
#define INLVLC1                       4088
#define INLVLC2                       4089
#define INLVLC3                       4090
#define INLVLC4                       4091
#define INLVLC5                       4092
#define INLVLC6                       4093
#define INLVLC7                       4094
#define IOCCP                         4095
#define IOCCP0                        4096
#define IOCCP1                        4097
#define IOCCP2                        4098
#define IOCCP3                        4099
#define IOCCP4                        4100
#define IOCCP5                        4101
#define IOCCP6                        4102
#define IOCCP7                        4103
#define IOCCN                         4104
#define IOCCN0                        4105
#define IOCCN1                        4106
#define IOCCN2                        4107
#define IOCCN3                        4108
#define IOCCN4                        4109
#define IOCCN5                        4110
#define IOCCN6                        4111
#define IOCCN7                        4112
#define IOCCF                         4113
#define IOCCF0                        4114
#define IOCCF1                        4115
#define IOCCF2                        4116
#define IOCCF3                        4117
#define IOCCF4                        4118
#define IOCCF5                        4119
#define IOCCF6                        4120
#define IOCCF7                        4121
#define CCDNC                         4122
#define CCDNC0                        4123
#define CCDNC1                        4124
#define CCDNC2                        4125
#define CCDNC3                        4126
#define CCDNC4                        4127
#define CCDNC5                        4128
#define CCDNC6                        4129
#define CCDNC7                        4130
#define CCDPC                         4131
#define CCDPC0                        4132
#define CCDPC1                        4133
#define CCDPC2                        4134
#define CCDPC3                        4135
#define CCDPC4                        4136
#define CCDPC5                        4137
#define CCDPC6                        4138
#define CCDPC7                        4139
#define WPUE                          4140
#define WPUE3                         4141
#define INLVLE                        4142
#define INLVLE3                       4143
#define IOCEP                         4144
#define IOCEP3                        4145
#define IOCEN                         4146
#define IOCEN3                        4147
#define IOCEF                         4148
#define IOCEF3                        4149
#define STATUS_SHAD                   4150
#define C_SHAD                        4151
#define DC_SHAD                       4152
#define Z_SHAD                        4153
#define WREG_SHAD                     4154
#define BSR_SHAD                      4155
#define PCLATH_SHAD                   4156
#define FSR0L_SHAD                    4157
#define FSR0H_SHAD                    4158
#define FSR1L_SHAD                    4159
#define FSR1H_SHAD                    4160
#define STKPTR                        4161
#define TOSL                          4162
#define TOSH                          4163

#endif // _PIC16F18856_H_
